Repository: GSIL-Monitor/platform.framework.web.chromium-efl
Catalog: tizen_src/ewk/po_tizen/*.po
Languages: ga, mk, ro

# IDS_BR_OPT_CALL
source: Call
ga: Glaoigh
mk: Повик
ro: Apel

# IDS_BR_HEADER_UNABLE_TO_OPEN_FILE
source: Unable to open file
ga: Ní féidir an comhad a oscailt
mk: Не може да се отвори фајлот
ro: Fișierul nu poate fi deschis

source: Unable to open the file at %s. It may have been removed or renamed, or file permissions may be preventing access.
ga: Ní féidir an comhad ag %s a oscailt. Is féidir gur baineadh nó athainmníodh é, nó is féidir go bhfuil bac ar rochtain ag ceadanna comhaid.
mk: Не може да се отвори фајлот во %s. Може е преместен или преименуван или дозволите за фајлови спречуваат пристап.
ro: Fișierul din %s nu poate fi deschis. Este posibil ca acesta să fi fost eliminat sau redenumit sau este posibil ca permisiunile legate de fișier să blocheze accesul.

# IDS_BR_BODY_SAVE_LINK
source: Save link
ga: Sábháil nasc
mk: Сочувај линк
ro: Salvare link

# IDS_BR_BODY_ADD_TO_CONTACT
source: Add to contact
ga: Cuir le teagmhálaí
mk: Додај на запис
ro: Adăugare la contacte

# IDS_WEBVIEW_TPOP_UNABLE_TO_PLAY_VIDEOS_DURING_CALLS
source: Unable to play videos during calls.
ga: Ní féidir físeáin a sheinm le linn glaonna.
mk: Не може да се пуштаат видеа при повици.
ro: Nu se pot reda videoclipuri în timpul apelurilor.

source: Sign in to this website again by swiping any of your registered fingers over the home key. Your username and password for this website will be saved on your device.
ga: Sínigh isteach chuig an láithreán Gréasáin seo arís trí aon cheann de do mhéara cláraithe a svaidhpeáil thar an eochair bhaile. Sábhálfar d'ainm úsáideora agus do phasfhocal don láithreán gréasáin seo ar do ghléas.
mk: Најавете се на оваа интернет страница повторно поминувајќи со некој од регистрираните прсти преку копчето дома. Корисничкото име и лозинката за оваа интернет страница ќе се сочуваат на уредот.
ro: Conectați-vă din nou la acest site web glisând peste tasta acasă cu oricare dintre amprentele înregistrate. Numele de utilizator și parola pentru acest site web vor fi salvate pe dispozitiv.

# IDS_WEBVIEW_POP_SAVE_THIS_PASSWORD_ON_THIS_DEVICE_Q
source: Save this password on this device?
ga: Sábháil an pasfhocal seo ar an ngléas seo?
mk: Да се сочува лозинката на овој уред?
ro: Salvați această parolă pe acest dispozitiv?

# IDS_WEBVIEW_POP_P1SS_HP2SS_IS_REQUESTING_PERMISSION_TO_USE_YOUR_CAMERA
source: %1$s (%2$s) is requesting permission to use your camera.
ga: Tá %1$s (%2$s) ag iarraidh ceada le do cheamara a úsáid
mk: %1$s (%2$s) бара дозвола да ја користи Вашата камера.
ro: %1$s (%2$s) solicită permisiunea de a vă utiliza camera foto.

source: %1$s (%2$s) is requesting permission to store data on your device for offline use.
ga: Tá %1$s (%2$s) ag iarraidh ceada le sonraí a stóráil ar do ghléas le húsáid as líne
mk: %1$s (%2$s) бара дозвола да зачувува податоци на уредот за користење без интернет.
ro: %1$s (%2$s) solicită permisiunea de a salva date pe dispozitivul dvs. pentru utilizarea offline.

source: %1$s (%2$s) is requesting permission to store a large amount of data on your device for offline use.
ga: Tá %1$s (%2$s) ag iarraidh ceada le méid mór sonraí a stóráil ar do ghléas lena n-úsáid as líne.
mk: %1$s (%2$s) бара дозвола да сочува големо количество податоци на уредот за користење без интернет.
ro: %1$s (%2$s) solicită permisiunea să salveze un volum mare de date pe dispozitivul dvs. pentru a fi utilizate offline.

# IDS_WEBVIEW_POP_P1SS_HP2SS_IS_REQUESTING_PERMISSION_TO_SHOW_NOTIFICATIONS
source: %1$s (%2$s) is requesting permission to show notifications.
ga: Tá %1$s (%2$s) ag iarraidh ceada le fógraí a thaispeáint
mk: %1$s (%2$s) бара дозвола да покажува известувања.
ro: %1$s (%2$s) solicită permisiunea de a afișa notificări.

# IDS_WEBVIEW_POP_P1SS_HP2SS_IS_REQUESTING_PERMISSION_TO_ACCESS_YOUR_LOCATION
source: %1$s (%2$s) is requesting permission to access your location.
ga: Tá %1$s (%2$s) ag iarraidh ceada le do shuíomh a rochtain
mk: %1$s (%2$s) бара дозвола да пристапи кон Вашата локација.
ro: %1$s (%2$s) solicită permisiunea de a vă accesa locația.

# IDS_WEBVIEW_POP_LEAVE_THIS_PAGE_Q
source: Leave this page?
ga: Imigh ón leathanach seo?
mk: Излез од страницата?
ro: Părăsiți această pagină?

# IDS_WEBVIEW_POP_DO_YOU_WANT_THE_DEVICE_TO_REMEMBER_YOUR_PASSWORD_Q
source: Do you want the device to remember your password?
ga: An mian leat go gcuimhneoidh an gléas ar do phasfhocal?
mk: Сакате ли уредот да ја запомни лозинката?
ro: Doriți ca dispozitivul să memoreze parola?

# IDS_WEBVIEW_POP_A_TEMPORARY_ERROR_HAS_OCCURRED
source: A temporary error has occurred.
ga: Tharla earráid shealadach.
mk: Дојде до привремена грешка.
ro: A apărut o eroare temporară.

# IDS_WEBVIEW_OPT_WEB_SEARCH
source: Web search
ga: Cuardach Gréasáin
mk: Пребарување на Интернет
ro: Căutare Web

# IDS_WEBVIEW_OPT_UNMUTE
source: Unmute
ga: Díbhalbhaigh
mk: Звук
ro: Activare sunet

# IDS_WEBVIEW_OPT_TRANSLATE_ABB
source: Translate
ga: Cuir aistriúchán air
mk: Преведи
ro: Traducere

# IDS_WEBVIEW_OPT_SIGN_IN_USING_FINGERPRINTS
source: Sign in using fingerprints
ga: Sínigh isteach le méarloirg
mk: Најава со отпечаток на прст
ro: Conectați-vă cu amprentele

# IDS_WEBVIEW_OPT_SHOW_HIDE_MEDIA_CONTROLS_ABB
source: Show/hide media controls
ga: Folaigh/taisp. rialuithe meán
mk: Прикажи/сокриј контроли
ro: Afișare/ascund. comenzi media

# IDS_WEBVIEW_OPT_SELECT_TEXT_ABB
source: Select text
ga: Rogh. téacs
mk: Изб. текст
ro: Sel. text

# IDS_WEBVIEW_OPT_SELECTION_MODE_ABB
source: Selection mode
ga: Mód roghnaithe
mk: Режим за избор
ro: Mod selecție

# IDS_WEBVIEW_OPT_SAVE_IMAGE_ABB
source: Save image
ga: Sábháil íomhá
mk: Сочувај слика
ro: Salvare imagine

# IDS_WEBVIEW_OPT_PLAY_AUDIO_IN_NEW_TAB_ABB
source: Play audio in new tab
ga: Seinn fuaim i dtáb nua
mk: Пушти аудио во нова картичка
ro: Red. conț. audio în filă nouă

# IDS_WEBVIEW_OPT_PLAY
source: Play
ga: Seinn
mk: Емитувај
ro: Redare

# IDS_WEBVIEW_OPT_OPEN_VIDEO_IN_NEW_WINDOW_ABB
source: Open video in new window
ga: Oscail físeán i bhfuinneog nua
mk: Отвори видео во нов прозорец
ro: Desc. video în fereastră nouă

# IDS_WEBVIEW_OPT_OPEN_LINK_IN_NEW_TAB_ABB
source: Open link in new tab
ga: Oscail nasc i dtáb nua
mk: Отвори врска во нова картичка
ro: Deschidere link în filă nouă

# IDS_WEBVIEW_OPT_OPEN_IMAGE_IN_NEW_TAB_ABB
source: Open image in new tab
ga: Oscail íomhá i dtáb nua
mk: Отвори слика во нова картичка
ro: Deschidere imag. în filă nouă

# IDS_WEBVIEW_OPT_FULL_VIEW_ABB
source: Full view
ga: Amharc iomlán
mk: Целосен преглед
ro: Vedere integrală

# IDS_WEBVIEW_OPT_ENABLE_DISABLE_REPEAT_MEDIA_ABB
source: Enable/disable repeat media
ga: Cumas./díchum. Athsheinm meán
mk: Вкл./искл. повторување медиуми
ro: Activ./dezact. repetare media

# IDS_WEBVIEW_OPT_DRAG_AND_DROP_ABB
source: Drag and drop
ga: Tarraing agus scaoil
mk: Повлечи и пушти
ro: Glisare și fixare

# IDS_WEBVIEW_OPT_DO_NOT_SHOW_AGAIN
source: Do not show again
ga: Ná taispeáin arís
mk: Не прикажувај веќе
ro: Nu se afișează din nou

# IDS_WEBVIEW_OPT_CUT_ABB
source: Cut
ga: Gearr
mk: Исечи
ro: Tăiere

# IDS_WEBVIEW_OPT_COPY_VIDEO_URL_ABB
source: Copy video URL
ga: Cóipeáil URL an fhíseáin
mk: Копирај URL на видео
ro: Copiere adresă URL videoclip

# IDS_WEBVIEW_OPT_COPY_TO_CLIPBOARD
source: Copy to clipboard
ga: Cóipeáil chuig an ngearrthaisce
mk: Копирај во посредната меморија
ro: Copiere în clipboard

# IDS_WEBVIEW_OPT_COPY_LINK_URL_ABB
source: Copy link URL
ga: Cóipeáil nasc URL
mk: Копирај URL-линк
ro: Copiere URL link

# IDS_WEBVIEW_OPT_COPY_IMAGE
source: Copy image
ga: Cóipeáil íomhá
mk: Копирај слика
ro: Copiere imagine

# IDS_WEBVIEW_OPT_COPY_AUDIO_URL_ABB
source: Copy audio URL
ga: Cóipeáil URL fuaime
mk: Копирај URL на звук
ro: Cop. adresă URL conținut audio

# IDS_WEBVIEW_OPT_CLIPBOARD
source: Clipboard
ga: Gearrthaisce
mk: Посредна меморија

# IDS_WEBVIEW_HEADER_THIS_WEBPAGE_IS_NOT_AVAILABLE
source: This webpage is not available.
ga: Níl an leathanach gréasáin seo ar fáil
mk: Интернет-страницата не е достапна.
ro: Această pagină web nu este disponibilă.

# IDS_WEBVIEW_HEADER_SET_WEEK
source: Set week
ga: Socraigh seachtain
mk: Одреди седмица
ro: Setare săptămână

# IDS_WEBVIEW_HEADER_SET_TIME
source: Set time
ga: Socraigh am
mk: Одреди час
ro: Setați ora

# IDS_WEBVIEW_HEADER_SET_MONTH
source: Set month
ga: Socraigh mí
mk: Одреди месец
ro: Setați luna

# IDS_WEBVIEW_HEADER_SET_DATE
source: Set date
ga: Socraigh dáta
mk: Одреди датум
ro: Setați data

# IDS_WEBVIEW_HEADER_SELECT_COLOUR
source: Select colour
ga: Roghnaigh dath
mk: Избери боја
ro: Selectare culoare

# IDS_WEBVIEW_HEADER_REMEMBER_PASSWORD
source: Remember password
ga: Cuimhnigh ar phasfhocal
mk: Запомни лозинка
ro: Memorați parola

# IDS_WEBVIEW_HEADER_MESSAGE_FROM_PS_M_WEBSITE
source: Message from %s
ga: Teachtaireacht ó %s
mk: Порака од %s
ro: Mesaj de la %s

# IDS_WEBVIEW_BUTTON_UPLOAD_MULTIPLE_FILES
source: Upload multiple files
ga: Uaslódáil ilchomhad
mk: Прати повеќе фајлови
ro: Încărcare fișiere multiple

# IDS_WEBVIEW_BUTTON_UPLOAD_FILE
source: Upload file
ga: Uaslódáil comhad
mk: Прати фајл
ro: Încărcare fișier

# IDS_WEBVIEW_BUTTON_SUBMIT
source: Submit
ga: Cuir isteach
mk: Поднеси
ro: Trimitere

# IDS_WEBVIEW_BUTTON_STAY
source: Stay
ga: Fan
mk: Остани
ro: Rămâneți

# IDS_WEBVIEW_BUTTON_PREV_ABB
source: Prev.
ga: Siar
mk: Прет.
ro: Ant.

# IDS_WEBVIEW_BUTTON_NOT_NOW_ABB
source: Not now
ga: Ní anois
mk: Не сега
ro: Nu acum

# IDS_WEBVIEW_BUTTON_LEAVE
source: Leave
ga: Imigh as
mk: Напушти
ro: Părăsiți

# IDS_WEBVIEW_BUTTON_CANCEL_ABB4
source: Cancel
ga: Ar Ceal
mk: Откажи
ro: Anul.

# IDS_WEBVIEW_BUTTON2_NEVER
source: Never
ga: Choíche
mk: Никогаш
ro: Niciodată

# IDS_WEBVIEW_BODY_YOU_CAN_SEARCH_THIS_INDEX_ENTER_KEYWORDS_C
source: You can search this index. Enter keywords:
ga: Is féidir leat an t-innéacs seo a chuardach. Iontráil eochairfhocail:
mk: Можете да го пребарувате овој индекс. Внесете клучни зборови:
ro: Puteți căuta în acest index. Introduceți cuvintele cheie:

# IDS_WEBVIEW_BODY_VALUE_MUST_BE_NO_HIGHER_THAN_PD
source: Value must be no higher than %d.
ga: Níor cheart don luach a bheith níos airde ná %d
mk: Вредноста не смее да биде поголема од %d.
ro: Valoarea nu trebuie să fie mai mare decât %d.

# IDS_WEBVIEW_BODY_VALUE_MUST_BE_AT_LEAST_PD
source: Value must be at least %d.
ga: Ní mór %d ar a laghad a bheith sa luach
mk: Вредноста мора да биде барем %d.
ro: Valoarea trebuie să fie de cel puțin %d.

source: Unable to load the page. %s took too long to respond. The website may be down, or there may have been a network connection error.
ga: Ní féidir an leathanach a lódáil. Níor fhreagair %s in am cuí. D'fhéadfadh an láithreán gréasáin a bheith as feidhm, nó is féidir gur tharla earráid leis an nasc líonra
mk: Не може да се вчита страницата. %s не реагира долго време. Интернет-страницата може да е недостапна или има проблем со мрежното поврзување.
ro: Pagina nu poate fi încărcată. %s a necesitat prea mult timp pentru a răspunde. Este posibil ca site-ul web să fie nefuncțional sau se poate să fi apărut o eroare de conexiune la rețea.

source: Unable to load the page. %s may be temporarily down or have moved to a new URL.
ga: Ní féidir an leathanach a lódáil. Is féidir go bhfuil %s as feidhm go sealadach nó gur bogadh chuig URL nua é
mk: Не може да се вчита страницата. %s може да е привремено недостапна или е преместена на ново URL.
ro: Pagina nu poate fi încărcată. Este posibil ca %s să fie temporar nefuncțională sau să fi fost mutată la o altă adresă URL.

source: Unable to load the page. A secure connection could not be made to %s. The most likely cause is the device's clock. Check that the time on your device is correct and refresh the page.
ga: Ní féidir an leathanach a lódáil. Níorbh fhéidir nasc slán a dhéanamh le %s. Is é clog an ghléis an chúis is dóchúla. Seiceáil go bhfuil an t-am ar do ghléas i gceart agus athnuaigh an leathanach
mk: Не може да се вчита страницата. Не можеше да се воспостави безбедна врска со %s. Најверојатна причина е часовникот на уредот. Проверете дали времето на уредот е точно и обновете ја страницата.
ro: Pagina nu poate fi încărcată. Nu s-a putut stabili o conexiune securizată la %s. Cauza cea mai probabilă este ceasul dispozitivului. Asigurați-vă că ora de pe dispozitiv este corectă și actualizați pagina.

source: The server at %s can't be found because the DNS look-up failed. DNS is the network service that translates a website's name to its Internet address. This error is most often caused by having no connection to the Internet or a misconfigured network. It can also be caused by an unresponsive DNS server or a firewall preventing Internet from accessing the network.
ga: Ní féidir an freastalaí ag %s a aimsiú ós rud é gur theip ar chuardach DNS. Is é DNS an tseirbhís líonra a aistríonn ainm láithreáin ghréasáin chuig a sheoladh Idirlín. Tarlaíonn an earráid seo den chuid is mó nuair nach bhfuil nasc leis an Idirlíon nó má tá líonra míchumraithe. D'fhéadfadh sé tarlú fosta mar gheall ar fhreastalaí DNS neamhfhreagrúil nó mar gheall ar bhalla dóiteáin a chuireann bac ar rochtain ar an líonra ón Idirlíon
mk: Серверот на %s не може да се најде затоа што не успеа барањето DNS. DNS е мрежна услуга што ги преведува имињата на интернет страниците во адресата за интернет. Оваа грешка најчесто ја предизвикува немање врска со интернет или погрешно конфигурирана мрежа. Може да е предизвикана и од сервер за DNS што не одговара или заштитен ѕид што спречува интернет да пристапува до мрежата.
ro: Serverul de la %s nu poate fi găsit, deoarece căutarea DNS nu a reușit. DNS este serviciul de rețea care traduce numele unui site web în adresa de internet a acestuia. Această eroare apare cel mai frecvent din cauza lipsei unei conexiuni la internet sau din cauza unei rețele configurate greșit. De asemenea, cauza poate fi un server DNS care nu răspunde sau un firewall care nu permite accesul internetului la rețea.

# IDS_WEBVIEW_BODY_SHOWING_PD_ITEMS_TTS
source: Showing %d items
ga: %d mír á dtaispeáint
mk: Се прикажуваат %d ставки
ro: Se afișează %d elemente

# IDS_WEBVIEW_BODY_PLUG_IN_MISSING
source: Plug-in missing
ga: Plugáil isteach ar iarraidh
mk: Недостига додаток
ro: Plugin lipsă

# IDS_WEBVIEW_BODY_PD_CHARACTERS_TTS
source: %d characters.
ga: %d carachtar.
mk: %d знаци.
ro: %d caractere.

# IDS_WEBVIEW_BODY_NO_FILES_HAVE_BEEN_SELECTED
source: No files have been selected.
ga: Níor roghnaíodh aon chomhad
mk: Не се избрани фајлови.
ro: Nu au fost selectate fișiere.

# IDS_WEBVIEW_BODY_INVALID_VALUE_ENTERED
source: Invalid value entered.
ga: Iontráladh luach neamhbhailí.
mk: Внесена е неважечка вредност.
ro: Valoare nevalidă introdusă

# IDS_WEBVIEW_BODY_INVALID_FORMAT_ENTERED
source: Invalid format entered.
ga: Iontráladh formáid neamhbhailí.
mk: Внесен е погрешен формат.
ro: Format nevalid introdus

# IDS_WEBVIEW_BODY_FIELD_CANNOT_BE_BLANK
source: Field cannot be blank.
ga: Ní féidir an réimse a fhágáil bán
mk: Полето не може да биде празно.
ro: Câmpul nu poate rămâne necompletat.

# IDS_WEBVIEW_BODY_ENTER_A_URL
source: Enter a URL.
ga: Iontráil URL
mk: Внесете URL.
ro: Introducere adresă URL

# IDS_WEBVIEW_BODY_ENTER_A_LIST_OF_EMAIL_ADDRESSES_SEPARATED_BY_COMMAS
source: Enter a list of email addresses, separated by commas.
ga: Iontráil liosta seoltaí r-phoist bailí, á scaradh le camóga
mk: Внесете листа адреси за е-пошта одделени со запирки.
ro: Introduceți o listă de adrese de e-mail, separate prin virgulă.

# IDS_WEBVIEW_BODY_ENTER_AN_EMAIL_ADDRESS
source: Enter an email address.
ga: Iontráil seoladh r-phoist
mk: Внесете адреса за е-пошта.
ro: Introduceți o adresă de e-mail.

# IDS_WEBVIEW_BODY_EDIT_FIELD__M_NOUN_TTS
source: Edit field
ga: Cuir réimse in eagar
mk: Измени поле
ro: Editați câmpul

# IDS_WEBVIEW_BODY_EDITING_TTS
source: Editing.
ga: Cur in eagar.
mk: Менување.
ro: Se editează.

# IDS_BR_POP_SAVED
source: Saved.
ga: Sábháilte.
mk: Меморирано.
ro: Salvat

# IDS_BR_POP_FAIL
source: Failed.
ga: Theip air.
mk: Неуспешно.
ro: Nereușit

# IDS_BR_OPT_SEND_EMAIL
source: Send email
ga: Seol r-phost
mk: Прати е-пошта
ro: Trimitere email

# IDS_WEBVIEW_OPT_SELECT_ALL_ABB
source: Select all
ga: Rogh. gach
mk: Изб. сите
ro: Sel. int.

# IDS_WEBVIEW_OPT_SELECT_ABB
source: Select
ga: Roghnaigh
mk: Избери
ro: Selectare

# IDS_WEBVIEW_OPT_PAUSE
source: Pause
ga: Cuir ar sos
mk: Пауза
ro: Întrerupere

# IDS_WEBVIEW_OPT_PASTE
source: Paste
ga: Greamaigh
mk: Пресликај
ro: Lipire

# IDS_WEBVIEW_OPT_MUTE
source: Mute
ga: Balbhaigh
mk: Исклучи звук
ro: Anulare sunet

# IDS_WEBVIEW_OPT_COPY
source: Copy
ga: Cóipeáil
mk: Копирај
ro: Copiere

# IDS_WEBVIEW_HEADER_SET_DATE_AND_TIME
source: Set date and time
ga: Socraigh dáta agus am
mk: Постави датум и време
ro: Setare dată și oră

# IDS_WEBVIEW_BUTTON_SET_ABB2
source: Set
ga: Socr.
mk: Пост.

# IDS_WEBVIEW_BUTTON_SAVE
source: Save
ga: Sábháil
mk: Сочувај
ro: Salvare

# IDS_WEBVIEW_BUTTON_RESET
source: Reset
ga: Athshocrú
mk: Ресетирај
ro: Resetare

# IDS_WEBVIEW_BUTTON_NEXT_ABB3
source: Next
ga: Ar agh.
mk: Следно
ro: Înainte

# IDS_WEBVIEW_BUTTON_LATER_ABB
source: Later
ga: Ar ball
mk: Подоцна
ro: Ulterior

# IDS_WEBVIEW_BUTTON_DONE
source: Done
ga: Déanta
mk: Готово
ro: Efectuat

# IDS_WEBVIEW_BODY_USERNAME
source: Username
ga: Ainm úsáideora
mk: Корисничко име
ro: Utilizator

# IDS_WEBVIEW_BODY_SELECTED_TTS
source: Selected
ga: Roghnaithe
mk: Избрано
ro: Selectat

# IDS_WEBVIEW_BODY_PASSWORD
source: Password
ga: Pasfhocal
mk: Лозинка
ro: Parolă

# IDS_WEBVIEW_BODY_NOT_SELECTED_TTS
source: Not selected
ga: Gan roghnú
mk: Не е одбрано
ro: Neselectat

# IDS_WEBVIEW_BODY_DOUBLE_TAB_TO_EDIT_TTS
source: Double tap to edit.
ga: Déthapáil lena cur in eagar.
mk: Допрете двапати за менување.
ro: Atingeți de două ori pentru a edita.

# IDS_WEBVIEW_BODY_DETAILS
source: Details
ga: Sonraí
mk: Детали
ro: Detalii

# IDS_WEBVIEW_OPT_SHARE
source: Share
ga: Comhroinn
mk: Сподели
ro: Partajați

# IDS_WEBVIEW_POP_SAVE_YOUR_USERNAME_AND_PASSWORD_FOR_THIS_WEBSITE_Q
source: Save your username and password for this website?
ga: Sábháil d'ainm úsáideora agus do phasfhocal le haghaidh an láithreáin gréasáin seo?
mk: Да се зачува Вашето корисничко име и лозинката за оваа интернет-страница?
ro: Salvați numele de utilizator și parola pentru acest site web?

# IDS_WEBVIEW_HEADER_SAVE_SIGN_IN_INFO
source: Save sign-in info
ga: Sábháil faisnéis sínithe isteach
mk: Зачувајте информации за најава
ro: Salvare informații conectare

# IDS_WEBVIEW_POP_P1SS_HP2SS_IS_REQUESTING_PERMISSION_TO_USE_YOUR_MICROPHONE
source: %1$s (%2$s) is requesting permission to use your microphone.
ga: Tá %1$s (%2$s) ag iarraidh ceada le do mhicreafón a úsáid.
mk: %1$s (%2$s) бара дозвола да го користи Вашиот микрофон.
ro: %1$s (%2$s) solicită permisiunea de a vă utiliza microfonul.

source: %1$s (%2$s) is requesting permission to use your camera and microphone.
ga: Tá %1$s (%2$s) ag iarraidh ceada le do cheamara agus do mhicreafón a úsáid.
mk: %1$s (%2$s) бара дозвола да ја користи Вашата камера и микрофонот.
ro: %1$s (%2$s) solicită permisiunea de a vă utiliza camera foto și microfonul.

source: Your device is not connected to a Wi-Fi or mobile network. Connect to a network and try again.
ga: Níl do ghléas nasctha le líonra Wi-Fi ná móibíleach. Nasc le líonra agus triail arís.
mk: Вашиот уред не е поврзан со Wi-Fi или со мобилна мрежа. Поврзете се со мрежа и обидете се повторно.
ro: Dispozitivul nu este conectat la o rețea Wi-Fi sau mobilă. Conectați-vă la o rețea și încercați din nou.

# IDS_WEBVIEW_POP_YOU_ARE_OFFLINE
source: You are offline.
ga: Tá tú as líne.
mk: Не сте во мрежа.
ro: Sunteți offline.

# IDS_BR_BODY_LOG_IN
source: Log in
ga: Logáil isteach
mk: Најава
ro: Conectare

# IDS_COM_BODY_SEND_MESSAGE
source: Send message
ga: Seol teachtaireacht
mk: Прати порака
ro: Trimitere mesaj

# IDS_TPLATFORM_OPT_COPY_LINK_TEXT
source: Copy link text
ga: Cóipeáil téacs an naisc
mk: Копирајте текст на врска
ro: Copiere text link

# IDS_WEBVIEW_OPT_OPEN_LINK_IN_CURRENT_TAB
source: Open link in current tab
ga: Oscail nasc sa táb reatha
mk: Отворете врска во тековната картичка
ro: Deschidere link în fila actuală

# IDS_WEBVIEW_OPT_OPEN_IMAGE_IN_CURRENT_TAB
source: Open image in current tab
ga: Oscail íomhá sa táb reatha
mk: Отворете слика во тековната картичка
ro: Deschidere imagine în fila actuală

# IDS_WEBVIEW_HEADER_QUICK_MEMO
source: Quick memo
ga: Mearmheabhrán
mk: Брза белешка
ro: Notă rapidă

# IDS_WEBVIEW_OPEN
source: Open
mk: Отвори
ro: Deschideţi
